tutorials-pM4F/dbsFoam/flowOnly/heterogeneousPermeability/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

runApplication blockMesh
runApplication setFields
runApplication $application

runApplication postProcess -func graphCell

runApplication gnuplot plot.gp

runApplication evince Pressure.eps



#------------------------------------------------------------------------------
