tutorials-pM4F/dbsFoam/flowOnly/heterogeneousPermeability/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(U|UFinal)"
    {
//        solver           smoothSolver;
	solver		PBiCG;
	preconditioner DILU;
        smoother         GaussSeidel;
//		solver	PCG;
//		preconditioner DIC;
        tolerance        1e-09;
        relTol           1e-4;
        nSweeps          1;
    }

    "(p|pFinal)"
    {
/*
		solver	PCG;
		preconditioner DIC;
        tolerance        1e-6;
        relTol           0.05;
*/
        solver           GAMG;
        tolerance        1e-10;
        relTol           0.0;
        smoother         DIC; //GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }



}



PIMPLE
{
    nNonOrthogonalCorrectors 2;
}


// ************************************************************************* //
